var all_scores = {'杨璐':[131,143,144],
    '王雪':[131,135,144],
    '韩林霖':[127,139,142],
    '沙龙逸':[123,148,136],
    '李鉴学':[126,135,140],
    '韩雨萌':[129,133,138],
    '刘帅':[116,143,140],
    '康惠雯':[114,142,139],
    '刘钰婷':[115,139,135],
    '林世博':[116,142,129]};
//存储所有学生的姓名.
var stu_names = ['杨璐','王雪','韩林霖'];
//打印数组stu_names中学生的成绩(成绩顺序依次是语文、数学、英语)
for(var i = 0; i < stu_names.length; i ++)
{
    var str_stu_score = stu_names[i]+'的成绩为：'+'语文：'+all_scores[stu_names[i]][0]+';'+'数学：'+all_scores[stu_names[i]][1]+';'+'英语：'+all_scores[stu_names[i]][2]+';';
    console.log(str_stu_score);
}